
## Plan Result (repository)

[CI link](https://github.com/tqer39/terraform-github/actions/runs/15653211383)


<pre><code>Plan: 6 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.nana_kana_dialogue_system.github_actions_repository_permissions.this
  * module.nana_kana_dialogue_system.github_branch.this[&#34;development&#34;]
  * module.nana_kana_dialogue_system.github_branch_default.this
  * module.nana_kana_dialogue_system.github_branch_protection.this[&#34;development&#34;]
  * module.nana_kana_dialogue_system.github_branch_protection.this[&#34;main&#34;]
  * module.nana_kana_dialogue_system.github_repository.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.nana_kana_dialogue_system.github_actions_repository_permissions.this will be created
  + resource "github_actions_repository_permissions" "this" {
      + allowed_actions = "all"
      + enabled         = true
      + id              = (known after apply)
      + repository      = "nana-kana-dialogue-system"
    }

  # module.nana_kana_dialogue_system.github_branch.this["development"] will be created
  + resource "github_branch" "this" {
      + branch        = "development"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "nana-kana-dialogue-system"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.nana_kana_dialogue_system.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "nana-kana-dialogue-system"
    }

  # module.nana_kana_dialogue_system.github_branch_protection.this["development"] will be created
  + resource "github_branch_protection" "this" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "development"
      + repository_id                   = "nana-kana-dialogue-system"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = true
    }

  # module.nana_kana_dialogue_system.github_branch_protection.this["main"] will be created
  + resource "github_branch_protection" "this" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "nana-kana-dialogue-system"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.nana_kana_dialogue_system.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "女子高生ナナと社会人カナによる対話型コンテンツ制作システム - 3D Animation + TTS + Ghost CMS"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "nana-kana-dialogue-system"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "3d-animation",
          + "ai-content",
          + "blender",
          + "content-generation",
          + "dialogue-system",
          + "fastapi",
          + "ghost-cms",
          + "javascript",
          + "python",
          + "react",
          + "text-to-speech",
          + "three-js",
          + "typescript",
        ]
      + visibility                  = "private"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-github","PRNumber":1279,"Program":"tfcmt","SHA1":"50973439eef5ed3a9c5b0f62f8528759ccf85c30","Target":"repository","Vars":{},"WorkflowName":"Terraform - GitHub"} -->